app/views/artists/index.html.erb

SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = $1  [["artist_id", 6]]
---
          <ul>
          <% artist.songs.each do |song| %>