app/views/artists/show.html.erb

SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = $1  [["artist_id", 15]]
---
              </tr>
              <% @artist.songs.each do |song| %>