app/controllers/artists_controller.rb

  def destroy
    # artist = Artist.find(params[:id])
    @artist.destroy
---
DELETE FROM "artists" WHERE "artists"."id" = $1  [["id", 19]]