app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "created_at", "updated_at", "artist_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "I'd Do Anything For Love"], ["created_at", "2018-01-26 19:14:03.390646"], ["updated_at", "2018-01-26 19:14:03.390646"], ["artist_id", 4]]
---
  def create
    @song = @artist.songs.new(song_params)
    @song.save

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 2]]
---
  def destroy
    @song = Song.find(params[:id])
    @song.destroy

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
  def set_artist
    @artist = Artist.find(params[:artist_id])